import React from 'react';
import Zoom from 'react-reveal/Zoom'

function Gold() {
    return (
        <section className='gold' id='gold'>
            <div className='container'>
                <div className='row'>
                    <Zoom>
                        <img src='Images/p-1.jpg'></img>
                    </Zoom>
                    <Zoom>
                        <div className='text'><h2>يستخدم وصف العصر الذهبي للإسلام</h2><p>لوصف مرحلة تاريخية كانت الحضارة الإسلامية فيها متقدمة علمياً وثقافياً، وتمتد من منتصف القرن الثامن لغاية القرن الرابع عشر والخامس عشر الميلادي.</p></div>
                    </Zoom>
                </div>
                <div className='row row-2'>
                    <Zoom >
                        <div className='text'><h2>خلال هذه الفترة</h2><p> ، قام مهندسو وعلماء وتجار العالم الإسلامي بالمساهمة بشكل كبير في حقول الفن والزراعة والاقتصاد والصناعة والأدب والملاحة والفلسفة والعلوم والتكنولوجيا والفلك والطب، من خلال المحافظة والبناء على المساهمات السابقة وبإضافة العديد من اختراعاتهم وابتكاراتهم. وخلق الفلاسفة والشعراء والفنانون والعلماء والأمراء المسلمون ثقافة فريدة من نوعها أثرت بدورها على المجتمعات في كل القارات.</p></div>
                    </Zoom>
                    <Zoom>
                        <img src='Images/p-2.jpg'></img>
                    </Zoom>
                </div>
                <div className='row'>
                    <Zoom>
                        <img src='Images/p-3.jpg'></img>
                    </Zoom>
                    <Zoom >
                        <div className='text'><h2>يقال تقليديًا </h2><p>أن الفترة انتهت بانهيار الخلافة العباسية بسبب الغزوات المغولية وحصار بغداد عام 1258. قلة من العلماء يؤرخون نهاية العصر الذهبي حوالي عام 1350 تزامناً مع النهضة التيمورية، في حين أن العديد من المؤرخين والعلماء المعاصرين يضعون نهاية العصر الذهبي الإسلامي في وقت متأخر من نهاية القرنين الخامس عشر والسادس عشر تزامناً مع عصر إمبراطوريات البارود.</p></div>
                    </Zoom>
                </div>
            </div>
        </section>
    );
}

export default Gold;
