import React from 'react';
import Zoom from 'react-reveal/Zoom'

function Works() {
    return(
        <section className='works' id='works'>
            <div className='container'>
                <Zoom >
                    <div className='card'>
                        <img src='Images/1.png'></img>
                        <h3>سقوطُ بُخارى وسَمرقند</h3>
                        <p>"أنا سائر لك واو أنك في اخر الدنيا , لأفعل بك كما فعلت بأصحابك" ,هاي كانت رسالة محمد ن خوارزم شاه لجنكيز خان بعد ما قتل رسوله وحلق لحى من كان معه , وفعلا زي ما جاء بالرسالة , السلطان محمد سار بجيشه اربعة أشهر , حتى وصل الى احدى مناطق التتار السكنية التابعة لجنكيز , فقتل كل الي كانوا بالمنطقة من رجال ونساء وأطفال , وكان سبب غياب المغول عن بيوتهم إنهم كانو ذاهبين لقتال ملك من ملوك المغول يدعى كشلو خان , قاتلوه وهزموه...</p>
                    </div>
                </Zoom>
                <Zoom >
                <div className='card'>
                    <img src='Images/2.png'></img>
                    <h3>نهايةُ السلطانِ محمّد</h3>
                    <p>خرج جنكيز خان بجيش جرار لغزو الدولة الخوارزمية فخرج له محمد بن خوارزم شاه في معركة سيحوون استشهد من المسلمين 20 الفا ومن التتار هلك اضعاف ذلك بعد اربع ايام من القتال جنكيز خان طلب المدد فاصبح طول جيشه على مد البصر محمد شاه لم يبقى في الميدان وانما اختارالهرع الى حصون عاصمته المنيعة وترك الجانب الشرقي...</p>
                </div>
                </Zoom>
                <Zoom >
                    <div className='card'>
                        <img src='Images/3.png'></img>
                        <h3>كَيف أٌشعلت نارُ المغول؟</h3>
                        <p> فالقصة بدأت في القرن السابع للهجرة تيموجين بعد ان قام بتوحيد قبائل التتر المتناثرة حاصر الصين وقضى على اسرة تيموجين الحاكمة في عام واحد فقط اثبت للعالم اجمع قوته وصار الجميع يهاب منه سمى نفسه جنكيز خان بمعنى "الملك الأعظم" وصار شريعته حديث الناي نفس الفترة لكن على الجانب الاخر من قارة اسيا...</p>
                    </div>
                </Zoom>
            </div>
        </section>
    );
}

export default Works;
